### Pandas

Pandas is an open source Python package providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

### Basic Unit of Pandas

<ol>
<li>Series - one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.</li>
<li>Dataframes- two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns - dataframe shall be collection of series</li>
</ol>

In [1]:
import pandas as pd
import numpy as np

### Creating a Dataframe

#### From a list of lists

In [2]:
data = [['Abinav',95],['Radha',87],['Kumar',98],['Amutha',71],['Ramesh',63]]

In [3]:
marks_df = pd.DataFrame(data,columns=['Name','Marks'])

In [4]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Amutha     71
4  Ramesh     63

In [6]:
marks_df.T

            0      1      2       3       4
Name   Abinav  Radha  Kumar  Amutha  Ramesh
Marks      95     87     98      71      63

In [7]:
type(marks_df)

pandas.core.frame.DataFrame

In [8]:
type(marks_df['Name'])

pandas.core.series.Series

#### From dict of narray/lists

In [9]:
data = {'Name':['Abinav','Radha','Kumar','Amutha','Ramesh'],'Marks':[95,87,98,71,63]}

In [10]:
marks_df = pd.DataFrame(data)

In [11]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Amutha     71
4  Ramesh     63

#### From dict of narray/lists

In [12]:
data = [{'Name':'Abinav','Marks':95}, {'Name':'Radha','Marks':87},{'Name':'Kumar','Marks':98},{'Name':'Ramesh','Marks':63},{'Name':'Amutha','Marks':71}]

In [14]:
marks_df = pd.DataFrame(data)

In [15]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Ramesh     63
4  Amutha     71

#### From Two Lists using Zip

In [16]:
Names = ['Abinav','Radha','Kumar','Amutha','Ramesh']
Marks = [95,87,98,71,63]

In [19]:
marks_df = pd.DataFrame(list(zip(Names,Marks)),columns=['Name','Marks'])

In [20]:
marks_df

     Name  Marks
0  Abinav     95
1   Radha     87
2   Kumar     98
3  Amutha     71
4  Ramesh     63

### Creating DataFrame from files

DataFrame can be created from three types of files:
<ol>
    <li>Comma Separated Values(CSV files) - read_csv function</li>
    <li> Excel Files - read_excel function</li>
    <li> Text files - read_table function</li>
</ol>

Separators maybe specified while using read_csv or read_table functions

In [23]:
sslc = pd.read_csv('sslc1.txt',sep=';',header=None,index_col=None)

/home/janaki/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

#### Display first five records

In [24]:
sslc.head()

  0      1            2    3    4   5   6   7    8    9    10  11
0  A  10001  ABINESH T N  053  036  28  16  44  177  NaN  NaN NaN
1  A  10002      ANAND R  058  037  42  35  40  212    P  NaN NaN
2  A  10003      ANISH M  072  056  71  55  70  324    P  NaN NaN
3  A  10004   ANITHRAJ S  087  064  83  58  65  357    P  NaN NaN
4  A  10005    ARIDHAS N  059  045  50  35  48  237    P  NaN NaN

In [25]:
sslc.columns = ['region','roll_number','name','fl','sl','math','sci','ss','total','pass','withheld','extra']

In [26]:
sslc.head(7)

,region,roll_number,name,fl,sl,math,sci,ss,total,pass,withheld,extra
0,A,10001,ABINESH T N,053,036,28,16,44,177,NaN,NaN,NaN
1,A,10002,ANAND R,058,037,42,35,40,212,P,NaN,NaN
2,A,10003,ANISH M,072,056,71,55,70,324,P,NaN,NaN
3,A,10004,ANITHRAJ S,087,064,83,58,65,357,P,NaN,NaN
4,A,10005,ARIDHAS N,059,045,50,35,48,237,P,NaN,NaN
5,A,10006,ARUN S,044,037,25,18,37,161,NaN,NaN,NaN
6,A,10007,GOPALAKRISHNAN M,062,046,49,36,44,237,P,NaN,NaN

#### Display Last Eight Records

In [27]:
sslc.tail(8)

,region,roll_number,name,fl,sl,math,sci,ss,total,pass,withheld,extra
185659,C,199991,MURALI M,063,042,37,35,60,237,P,NaN,NaN
185660,C,199992,SANGILIMANI C,058,044,36,20,45,203,NaN,NaN,NaN
185661,C,199994,DHANABALAN V,044,038,25,17,41,165,NaN,NaN,NaN
185662,C,199995,SARAVANAN A,053,034,26,24,44,181,NaN,NaN,NaN
185663,C,199996,JONATHAN J,051,038,24,15,41,169,NaN,NaN,NaN
185664,C,199997,SATHISH KUMAR M,049,039,12,20,24,144,NaN,NaN,NaN
185665,C,199998,NAGARAJ R,033,036,22,15,35,141,NaN,NaN,NaN
185666,C,199999,NAGARAJ P,017,014,15,14,20,80,NaN,NaN,NaN

### General attributes of dataframe

In [32]:
# returns number of data(cells) in the dataframe
sslc.size

2228004

In [33]:
# returns the number of null values in each column
sslc.count()

region         185667
roll_number    185667
name           185667
fl             185667
sl             185667
math           185667
sci            185667
ss             185667
total          185667
pass           159072
withheld          113
extra               0
dtype: int64

In [34]:
# Return a tuple of the number of records(rows) and number of attributes (columns)
sslc.shape

(185667, 12)

In [35]:
# Return number of dimensions of the dataframe
sslc.ndim

2

#### Summary about dataframe

In [256]:
sslc.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185667 entries, 10001 to 199999
Data columns (total 11 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   region    185667 non-null  object
 1   name      185667 non-null  object
 2   fl        185667 non-null  object
 3   sl        185667 non-null  object
 4   math      185667 non-null  object
 5   sci       185667 non-null  object
 6   ss        185667 non-null  object
 7   total     185667 non-null  object
 8   pass      159072 non-null  object
 9   withheld  113 non-null     object
 10  extra     0 non-null       float64
dtypes: float64(1), object(10)
memory usage: 17.0+ MB

#### Statistical Description about Dataframe
<ul>
    <li>By default it shows only for numerical attributes</li>
    <li>Keyword arguments shall be given to specifically display attributes</li>
    <li>For categorical attributes count,unique,top,freq are displayed</li>
</ul>

In [58]:
sslc.describe()

         roll_number  extra
count  185667.000000    0.0
mean   105014.949043    NaN
std     54921.152696    NaN
min     10001.000000    NaN
25%     57314.500000    NaN
50%    105291.000000    NaN
75%    152581.500000    NaN
max    199999.000000    NaN

In [258]:
sslc.describe(include=[object])

,region,name,fl,sl,math,sci,ss,total,pass,withheld
count,185667,185667,185667,185667,185667,185667,185667,185667,159072,113
unique,6,96438,96,95,99,98,97,882,1,1
top,B,MANIKANDAN M,085,035,35,35,35,278,P,W
freq,41341,242,5989,6703,12842,25723,5334,592,159072,113

In [259]:
sslc.describe(exclude=[object])

       extra
count    0.0
mean     NaN
std      NaN
min      NaN
25%      NaN
50%      NaN
75%      NaN
max      NaN

In [260]:
sslc.describe(include='all')

,region,name,fl,sl,math,sci,ss,total,pass,withheld,extra
count,185667,185667,185667,185667,185667,185667,185667,185667.0,159072,113,0.0
unique,6,96438,96,95,99,98,97,882.0,1,1,NaN
top,B,MANIKANDAN M,085,035,35,35,35,278.0,P,W,NaN
freq,41341,242,5989,6703,12842,25723,5334,592.0,159072,113,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Number of bytes consumed

#### By DataFrame

In [261]:
sslc.memory_usage()

Index       1485336
region      1485336
name        1485336
fl          1485336
sl          1485336
math        1485336
sci         1485336
ss          1485336
total       1485336
pass        1485336
withheld    1485336
extra       1485336
dtype: int64

#### By a Specific Columns

In [63]:
sslc['pass'].nbytes

1485336

#### Accessing a Column

In [64]:
#Square brackets
sslc['region']

0         A
1         A
2         A
3         A
4         A
         ..
185662    C
185663    C
185664    C
185665    C
185666    C
Name: region, Length: 185667, dtype: object

In [65]:
#Print all column names
sslc.columns

Index(['region', 'roll_number', 'name', 'fl', 'sl', 'math', 'sci', 'ss',
       'total', 'pass', 'withheld', 'extra'],
      dtype='object')

In [66]:
#Dot operator
sslc.withheld

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
         ...
185662    NaN
185663    NaN
185664    NaN
185665    NaN
185666    NaN
Name: withheld, Length: 185667, dtype: object

#### Reterving rows

#### By default numerical index given by Pandas

In [67]:
sslc.iloc[0]

region                   A
roll_number          10001
name           ABINESH T N
fl                     053
sl                     036
math                    28
sci                     16
ss                      44
total                  177
pass                   NaN
withheld               NaN
extra                  NaN
Name: 0, dtype: object

#### Change index of dataframe

In [71]:
sslc.set_index('roll_number',inplace=True)

#### Access row by index column specified by user

In [72]:
sslc.loc[10001]

region                A
name        ABINESH T N
fl                  053
sl                  036
math                 28
sci                  16
ss                   44
total               177
pass                NaN
withheld            NaN
extra               NaN
Name: 10001, dtype: object

### Accessing a data in dataframe

#### Using row and column indices given by Pandas

sslc.iat[0,1]

#### Using indices specified by programmer

In [83]:
sslc.at[10001,'name']

'ABINESH T N'

#### Replace a value

In [80]:
sslc['fl'].replace('AA',np.nan,inplace=True)
sslc['sl'].replace('AA',np.nan,inplace=True)
sslc['math'].replace('AA',np.nan,inplace=True)
sslc['sci'].replace('AA',np.nan,inplace=True)
sslc['ss'].replace('AA',np.nan,inplace=True)
sslc['total'].replace('AA',np.nan,inplace=True)

#### Find unique values in a column

In [79]:
sslc['sl'].unique()

array(['036', '037', '056', '064', '045', '046', '071', '040', '042',
       '041', '039', '038', '048', '043', '035', '032', '052', '058',
       '063', '031', '047', '055', '028', '029', '051', '059', '057',
       '033', '072', '062', '061', '065', '050', '049', '066', '069',
       '053', '077', '075', '054', '068', '024', '026', '060', '074',
       '023', '025', '027', '018', '017', '034', '020', '021', '022',
       '067', '015', '019', '016', '073', '080', '079', '070', '030',
       '044', '078', '085', '076', '083', '084', '092', '081', '082',
       '088', '086', '087', '089', '014', '012', '011', '010', '091',
       '008', '090', '009', '093', '094', '013', '006', '007', '004',
       '095', '096', '005', '097'], dtype=object)

#### Change datatype of a column

In [273]:
sslc['fl'] = sslc['fl'].astype(int)
sslc['sl'] = sslc['sl'].astype(int)
sslc['math'] = sslc['math'].astype(int)
sslc['sci'] = sslc['sci'].astype(int)
sslc['ss'] = sslc['ss'].astype(int)
sslc['total'] = sslc['total'].astype(int)

In [84]:
sslc['fl'] = pd.to_numeric(sslc['fl'], errors='coerce')
sslc['sl'] = pd.to_numeric(sslc['sl'], errors='coerce')
sslc['math'] = pd.to_numeric(sslc['math'], errors='coerce')
sslc['sci'] = pd.to_numeric(sslc['sci'], errors='coerce')
sslc['ss'] = pd.to_numeric(sslc['ss'], errors='coerce')
sslc['total'] = pd.to_numeric(sslc['total'], errors='coerce')

In [85]:
sslc.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185667 entries, 10001 to 199999
Data columns (total 11 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   region    185667 non-null  object
 1   name      185667 non-null  object
 2   fl        185642 non-null  float64
 3   sl        185667 non-null  int64
 4   math      185667 non-null  int64
 5   sci       185667 non-null  int64
 6   ss        185667 non-null  int64
 7   total     185667 non-null  int64
 8   pass      159072 non-null  object
 9   withheld  113 non-null     object
 10  extra     0 non-null       float64
dtypes: float64(2), int64(5), object(4)
memory usage: 21.0+ MB

In [88]:
sslc['sl'].nbytes

1485336

In [87]:
sslc['name'].nbytes

1485336

In [89]:
sslc.describe()

,fl,sl,math,sci,ss,total,extra
count,185642.000000,185667.000000,185667.000000,185667.000000,185667.000000,185667.000000,0.0
mean,73.564430,53.838178,62.845998,50.710395,63.186312,304.055713,NaN
std,14.124606,15.339820,23.483578,20.049274,16.916138,80.573235,NaN
min,4.000000,4.000000,1.000000,2.000000,3.000000,0.000000,NaN
25%,65.000000,43.000000,43.000000,35.000000,51.000000,246.000000,NaN
50%,76.000000,53.000000,62.000000,49.000000,64.000000,302.000000,NaN
75%,85.000000,65.000000,84.000000,65.000000,76.000000,366.000000,NaN
max,98.000000,97.000000,100.000000,100.000000,100.000000,488.000000,NaN

In [278]:
sslc.memory_usage()

Index       1485336
region      1485336
name        1485336
fl          1485336
sl          1485336
math        1485336
sci         1485336
ss          1485336
total       1485336
pass        1485336
withheld    1485336
extra       1485336
dtype: int64

#### Create sub dataframe with only a specific datatype

In [279]:
#filtered data frame
non_numeric = sslc.select_dtypes(include=[object])

#### Statistical measures of columns

In [280]:
sslc['total'].max()

488

In [281]:
sslc['total'].min()

0

In [282]:
sslc['total'].mean()

304.05571264683545

In [283]:
sslc['total'].median()

302.0

In [284]:
sslc['region'].mode()

0    B
dtype: object

#### Verify mode by priniting count of all regions

In [237]:
sslc['total'].std()

80.5732350749585

In [285]:
sslc['region'].value_counts()

B    41341
A    36401
C    31261
F    26414
D    25470
E    24780
Name: region, dtype: int64

In [286]:
sslc.isnull().sum()

region           0
name             0
fl               0
sl               0
math             0
sci              0
ss               0
total            0
pass         26595
withheld    185554
extra       185667
dtype: int64

#### Listdown unique values of a column

In [287]:
sslc['pass'].unique()

array([nan, 'P'], dtype=object)

In [288]:
sslc['pass'].value_counts()

P    159072
Name: pass, dtype: int64

In [222]:
sslc['pass'].isnull().sum()

26595

#### Replace null values of a column by a value

In [289]:
sslc['pass'] = sslc['pass'].fillna('F')

In [224]:
sslc['pass'].value_counts()

P    159072
F     26595
Name: pass, dtype: int64

In [290]:
sslc.withheld.value_counts()

W    113
Name: withheld, dtype: int64

### Conditional Indexing

#### Create a sub dataframe with only withheld results

In [92]:
sslc_WH = sslc[sslc['withheld']=='W']

In [93]:
sslc_WH

,region,name,fl,sl,math,sci,ss,total,pass,withheld,extra
roll_number,,,,,,,,,,,
27815,C,ARUN REGIS A,71.0,71,63,55,57,246,NaN,W,NaN
27816,C,NITHISH J,69.0,71,45,43,72,229,NaN,W,NaN
27817,C,LITHIYA ROSE P J,65.0,71,42,46,67,220,NaN,W,NaN
27818,C,MANJU D K,77.0,71,91,45,74,287,NaN,W,NaN
27819,C,NIVASA P,73.0,71,67,48,63,251,NaN,W,NaN
...,...,...,...,...,...,...,...,...,...,...,...
175759,A,MURUGAN P (ENG - EXEMPTION),57.0,49,36,18,36,147,NaN,W,NaN
177650,A,PANJU K DEAF AND DUMB,40.0,48,35,35,28,138,NaN,W,NaN
177667,A,VEERALAKSHMI P DEAF AND DUMB,29.0,43,16,14,38,97,NaN,W,NaN
184905,B,SATHYA R,15.0,67,10,8,41,74,NaN,W,NaN
184946,B,MARIYAMMAL M,14.0,40,14,6,45,79,NaN,W,NaN

#### Combining Conditions using and, or, xor

In [104]:
fl_and_sl = sslc[(sslc['fl']>75) & (sslc['sl']>75)]

In [105]:
fl_and_sl

,region,name,fl,sl,language_total,math,sci,ss,total,pass,withheld,extra
roll_number,,,,,,,,,,,,
10082,A,BRABIN V,93.0,77,0,88,76,93,427,P,NaN,NaN
10088,A,JEBASUGIN C,92.0,77,0,99,76,92,436,P,NaN,NaN
10234,A,BENAZIR M,90.0,80,0,96,86,80,432,P,NaN,NaN
10241,A,JULIE T,93.0,79,0,97,72,83,424,P,NaN,NaN
10286,A,PAULJEBASTIN A,78.0,78,0,100,69,88,413,P,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
199646,C,NATARAJAN P,90.0,77,0,100,83,95,445,P,NaN,NaN
199670,C,VIJAY V,93.0,76,0,98,84,100,451,P,NaN,NaN
199710,C,SANGEETHA V,91.0,79,0,96,85,87,438,P,NaN,NaN
199813,C,SARANYA C,92.0,77,0,91,75,94,429,P,NaN,NaN
199914,C,GOWRI S K,91.0,80,0,99,94,97,461,P,NaN,NaN

In [106]:
fl_or_sl = sslc[(sslc['fl']>75) | (sslc['sl']>75)]

In [108]:
fl_or_sl

,region,name,fl,sl,language_total,math,sci,ss,total,pass,withheld,extra
roll_number,,,,,,,,,,,,
10004,A,ANITHRAJ S,87.0,64,0,83,58,65,357,P,NaN,NaN
10008,A,JEGAN R,87.0,71,0,97,71,81,407,P,NaN,NaN
10014,A,KRISHNADHAS R,83.0,48,0,82,42,64,319,P,NaN,NaN
10023,A,PRATHEESH R,76.0,58,0,61,74,73,342,P,NaN,NaN
10031,A,SANKAR T,76.0,55,0,60,52,59,302,P,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
199965,C,ARIF RAHUMAN S,92.0,68,0,78,65,83,386,P,NaN,NaN
199967,C,OLI RAJA D,77.0,53,0,39,35,60,264,P,NaN,NaN
199970,C,JEYABATHRI A,83.0,63,0,84,41,77,348,P,NaN,NaN
199980,C,DHANASEKAR P,83.0,56,0,79,49,73,340,P,NaN,NaN
199986,C,GOPU A,77.0,51,0,44,35,58,265,P,NaN,NaN

In [107]:
fl_xor_sl = sslc[(sslc['fl']>75) ^ (sslc['sl']>75)]

In [109]:
fl_xor_sl

,region,name,fl,sl,language_total,math,sci,ss,total,pass,withheld,extra
roll_number,,,,,,,,,,,,
10004,A,ANITHRAJ S,87.0,64,0,83,58,65,357,P,NaN,NaN
10008,A,JEGAN R,87.0,71,0,97,71,81,407,P,NaN,NaN
10014,A,KRISHNADHAS R,83.0,48,0,82,42,64,319,P,NaN,NaN
10023,A,PRATHEESH R,76.0,58,0,61,74,73,342,P,NaN,NaN
10031,A,SANKAR T,76.0,55,0,60,52,59,302,P,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
199965,C,ARIF RAHUMAN S,92.0,68,0,78,65,83,386,P,NaN,NaN
199967,C,OLI RAJA D,77.0,53,0,39,35,60,264,P,NaN,NaN
199970,C,JEYABATHRI A,83.0,63,0,84,41,77,348,P,NaN,NaN
199980,C,DHANASEKAR P,83.0,56,0,79,49,73,340,P,NaN,NaN
199986,C,GOPU A,77.0,51,0,44,35,58,265,P,NaN,NaN

#### Findout number of pass and withheld results regionwise

In [292]:
sslc.groupby('region')['pass'].value_counts()

region  pass
A       P       31013
        F        5388
B       P       36202
        F        5139
C       P       26681
        F        4580
D       P       22080
        F        3390
E       P       20880
        F        3900
F       P       22216
        F        4198
Name: pass, dtype: int64

In [293]:
 sslc.groupby('region')['withheld'].value_counts()

region  withheld
A       W           14
B       W           12
C       W           19
D       W           14
E       W            7
F       W           47
Name: withheld, dtype: int64

#### Find the number of first language results withheld

In [94]:
sslc_WH['fl'].isnull().sum()

17

#### Create a dataframe with total marks greater than or equal to 300

In [96]:
sslc_60 = sslc[sslc['total']>=300]

In [97]:
# number of records in subdataframe
sslc_60.count()

region      95253
name        95253
fl          95252
sl          95253
math        95253
sci         95253
ss          95253
total       95253
pass        95229
withheld        1
extra           0
dtype: int64

### Insert a new column to have sum of language marks

In [98]:
sslc.insert(4,'language_total',0)

In [ ]:
sslc.head()

#### Function to find sum of two numbers

In [300]:
def total(fl,sl):
    return fl+sl

#### Call function to compute sum of fl and sl and store it in language_total column
Broadcasting happens

In [301]:
sslc['language_total'] = total(sslc['fl'],sslc['sl'])

In [302]:
sslc

,region,name,fl,sl,language_total,math,sci,ss,total,pass,withheld,extra
roll_number,,,,,,,,,,,,
10001,A,ABINESH T N,53,36,89,28,16,44,177,F,NaN,NaN
10002,A,ANAND R,58,37,95,42,35,40,212,P,NaN,NaN
10003,A,ANISH M,72,56,128,71,55,70,324,P,NaN,NaN
10004,A,ANITHRAJ S,87,64,151,83,58,65,357,P,NaN,NaN
10005,A,ARIDHAS N,59,45,104,50,35,48,237,P,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
199995,C,SARAVANAN A,53,34,87,26,24,44,181,F,NaN,NaN
199996,C,JONATHAN J,51,38,89,24,15,41,169,F,NaN,NaN
199997,C,SATHISH KUMAR M,49,39,88,12,20,24,144,F,NaN,NaN
199998,C,NAGARAJ R,33,36,69,22,15,35,141,F,NaN,NaN
199999,C,NAGARAJ P,17,14,31,15,14,20,80,F,NaN,NaN